In [3]:
import pandas as pd
# Creating a Dataframe from a Dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Mauro'],
'Age': [25, 33, 47, 19, 28, 17],
'City': ['Rome', 'Milan', 'Naples', 'Turin', 'Florence', 'Turin']}
df = pd.DataFrame(data)
# Print the first 5 rows of the dataframe
print(df.head())

      Name  Age      City
0    Alice   25      Rome
1      Bob   33     Milan
2  Charlie   47    Naples
3    David   19     Turin
4      Eva   28  Florence

In [7]:
#print colone
print(df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

In [11]:
df['Age']

0    25
1    33
2    47
3    19
4    28
5    17
Name: Age, dtype: int64

In [14]:
df[df['Age'] > 18]

      Name  Age      City
0    Alice   25      Rome
1      Bob   33     Milan
2  Charlie   47    Naples
3    David   19     Turin
4      Eva   28  Florence

In [21]:
df.groupby('City')['Age'].mean()

City
Florence    28.0
Milan       33.0
Naples      47.0
Rome        25.0
Turin       18.0
Name: Age, dtype: float64

In [22]:
df['Adult'] = df['Age'].apply(lambda x:'yes' if x > 18 else 'no')

In [24]:
df

      Name  Age      City Adult
0    Alice   25      Rome   yes
1      Bob   33     Milan   yes
2  Charlie   47    Naples   yes
3    David   19     Turin   yes
4      Eva   28  Florence   yes
5    Mauro   17     Turin    no

In [25]:
dfDrop = df.drop('City', axis=1)
print(dfDrop)

      Name  Age Adult
0    Alice   25   yes
1      Bob   33   yes
2  Charlie   47   yes
3    David   19   yes
4      Eva   28   yes
5    Mauro   17    no